<!DOCTYPE html>
<html>
<head>
<title>Software Defined Network Practicals</title>
</head>
<body>

<h1>Software Defined Network Practicals</h1>
<h3>MSc Computer Science - Cisco Packet Tracer Lab Manual</h3>
<p><strong>Submitted by:</strong> Darshan Jadhav | <strong>Roll No:</strong> MCS.25.06</p>
<p><strong>Guide:</strong> Ms. Flosia Moses | <strong>Academic Year:</strong> 2025-2026</p>

<div id="info">
    <h3>üìö Practical IDs for Scraping</h3>
    <p>Use these IDs to scrape individual practicals:</p>
    <ul>
        <li><strong>practical1a</strong> - SPAN Technologies (Switch Port Analyzer)</li>
        <li><strong>practical1b</strong> - SNMP Implementation</li>
        <li><strong>practical1c</strong> - Syslog Implementation</li>
        <li><strong>practical1d</strong> - Flexible NetFlow</li>
        <li><strong>practical2a_ra</strong> - GRE Tunnel - Router RA Configuration</li>
        <li><strong>practical2a_rb</strong> - GRE Tunnel - Router RB Configuration</li>
        <li><strong>practical2a_rc</strong> - GRE Tunnel - Router RC Configuration</li>
        <li><strong>practical2b</strong> - VTP Configuration</li>
        <li><strong>practical2c_r1</strong> - NAT - Router R1 Configuration</li>
        <li><strong>practical2c_r2</strong> - NAT - Router R2 Configuration</li>
        <li><strong>practical3_router</strong> - Inter-VLAN Routing - Router Configuration</li>
        <li><strong>practical3_s1</strong> - Inter-VLAN Routing - Switch S1 Configuration</li>
        <li><strong>practical3_s2</strong> - Inter-VLAN Routing - Switch S2 Configuration</li>
        <li><strong>practical4_d1</strong> - STP/RSTP - Switch D1 Configuration</li>
        <li><strong>practical4_d2</strong> - STP/RSTP - Switch D2 Configuration</li>
        <li><strong>practical4_a1</strong> - STP/RSTP - Switch A1 Configuration</li>
        <li><strong>practical4_rstp</strong> - RSTP Configuration and Testing</li>
        <li><strong>practical4_mst</strong> - MST Configuration</li>
        <li><strong>practical5_swa</strong> - EtherChannel - Switch SWA Configuration</li>
        <li><strong>practical5_swb</strong> - EtherChannel - Switch SWB Configuration</li>
        <li><strong>practical5_swc</strong> - EtherChannel - Switch SWC Configuration</li>
        <li><strong>practical6a_r1</strong> - Single-Area OSPF - Router R1</li>
        <li><strong>practical6a_r2</strong> - Single-Area OSPF - Router R2</li>
        <li><strong>practical6a_r3</strong> - Single-Area OSPF - Router R3</li>
        <li><strong>practical6b</strong> - Multi-Area OSPF Configuration</li>
        <li><strong>practical6c</strong> - OSPF Route Summarization</li>
        <li><strong>practical6d</strong> - OSPFv3 Configuration</li>
        <li><strong>practical7_r1</strong> - BGP - Router R1 Configuration</li>
        <li><strong>practical7_r2</strong> - BGP - Router R2 Configuration</li>
        <li><strong>practical7_r3</strong> - BGP - Router R3 Configuration</li>
        <li><strong>practical8_r1</strong> - IPsec VPN - Router R1 Configuration</li>
        <li><strong>practical8_r2</strong> - IPsec VPN - Router R2 Configuration</li>
        <li><strong>practical8_r3</strong> - IPsec VPN - Router R3 Configuration</li>
        <li><strong>practical8_gre</strong> - GRE over IPsec Configuration</li>
        <li><strong>practical8_vrf</strong> - VRF Lite Configuration</li>
        <li><strong>practical9_mininet</strong> - OpenDaylight with Mininet</li>
        <li><strong>practical9_ofnet</strong> - OFNet SDN Emulator</li>
        <li><strong>practical10</strong> - OpenFlow Using Mininet</li>
    </ul>
    <p><strong>üìù Example Python scraping code:</strong></p>
    <pre>
import requests
from bs4 import BeautifulSoup

response = requests.get('YOUR_URL')
code = BeautifulSoup(response.text, 'html.parser').find('div', id='practical1a').text
print(code)
    </pre>
</div>

<hr>

<h2>Practical 1: Network Monitoring Technologies</h2>

<h3>1A. SPAN Technologies (Switch Port Analyzer)</h3>
<p><strong>Aim:</strong> Implement SPAN Technologies to monitor switch port traffic.</p>
<p><strong>Packet Tracer Setup:</strong> 1 Router (2911), 1 Switch (2960), 1 PC. Connect PC0-Switch Fa0/1, Switch Fa0/2-Router Fa0/0.</p>

<div id="practical1a">
<pre>
Switch>enable
Switch#config terminal
Switch(config)# monitor session 1 source int fa0/1
Switch(config)# monitor session 1 destination int fa0/2
Switch(config)#end
</pre>
</div>

<h3>1B. SNMP Implementation</h3>
<p><strong>Aim:</strong> Implement SNMP for network monitoring.</p>
<p><strong>Packet Tracer Setup:</strong> 2 Routers, 1 Switch, 1 PC. On PC go to Desktop > MIB Browser.</p>

<div id="practical1b">
<pre>
R1>enable
R1#config terminal
R1(config)#int fa0/0
R1(config-if)#ip address 172.168.1.1 255.255.0.0
R1(config-if)#no shut
R1(config-if)#exit
R1(config)#snmp-server community read ro
R1(config)#snmp-server community write rw
</pre>
</div>

<h3>1C. Syslog Implementation</h3>
<p><strong>Aim:</strong> Configure Syslog server for logging router events.</p>
<p><strong>Packet Tracer Setup:</strong> 1 Router, 1 Switch, 1 PC, 1 Server. On Server go to Services > Syslog and turn ON.</p>

<div id="practical1c">
<pre>
R1>enable
R1#config terminal
R1(config)#int fa0/0
R1(config-if)#ip address 10.0.0.1 255.0.0.0
R1(config-if)#no shut
R1(config-if)#exit
R1(config)#int fa0/1
R1(config-if)#ip address 30.0.0.1 255.0.0.0
R1(config-if)#no shut
R1(config-if)#exit
R1(config)#logging 10.0.0.2
</pre>
</div>

<h3>1D. Flexible NetFlow</h3>
<p><strong>Aim:</strong> Implement Flexible NetFlow for traffic analysis.</p>

<div id="practical1d">
<pre>
R1>enable
R1#config terminal
R1(config)#int fa0/0
R1(config-if)#ip flow ingress
R1(config-if)#ip flow egress
R1(config-if)#ip flow-export source fa0/0
R1(config-if)#end
R1#show ip cache flow
</pre>
</div>

<hr>

<h2>Practical 2: Tunneling and VLAN Technologies</h2>

<h3>2A. GRE Tunnel Implementation</h3>
<p><strong>Aim:</strong> Configure GRE Tunnel between routers.</p>
<p><strong>Packet Tracer Setup:</strong> 3 Routers (RA, RB, RC), 2 PCs. Connect PC-A to RA G0/0, PC-C to RB G0/0. Serial connections: RA-RC and RB-RC.</p>

<h4>Router RA Configuration</h4>
<div id="practical2a_ra">
<pre>
Router>enable
Router#configure terminal
Router(config)#interface GigabitEthernet0/1
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#interface Serial0/0/0
Router(config-if)#ip address 20.0.0.2 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#router rip
Router(config-router)#network 20.0.0.0
Router(config-router)#exit

Router(config)#int tunnel 0
Router(config-if)#ip address 10.10.10.1 255.255.255.252
Router(config-if)#tunnel source s0/0/0
Router(config-if)#tunnel destination 30.0.0.2
Router(config-if)#tunnel mode gre ip
Router(config-if)#no shut
Router(config-if)#exit
Router(config)#ip route 192.168.2.0 255.255.255.0 10.10.10.2
</pre>
</div>

<h4>Router RB Configuration</h4>
<div id="practical2a_rb">
<pre>
Router>enable
Router#configure terminal
Router(config)#interface GigabitEthernet0/1
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#interface Serial0/0/1
Router(config-if)#ip address 30.0.0.2 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#router rip
Router(config-router)#network 192.168.2.0
Router(config-router)#network 30.0.0.0
Router(config-router)#exit

Router(config)#int tunnel 0
Router(config-if)#ip address 10.10.10.2 255.255.255.252
Router(config-if)#tunnel source s0/0/1
Router(config-if)#tunnel destination 20.0.0.2
Router(config-if)#tunnel mode gre ip
Router(config-if)#no shut
Router(config-if)#exit
Router(config)#ip route 192.168.1.0 255.255.255.0 10.10.10.1
</pre>
</div>

<h4>Router RC Configuration</h4>
<div id="practical2a_rc">
<pre>
Router>enable
Router#configure terminal
Router(config)#interface Serial0/0/0
Router(config-if)#ip address 20.0.0.1 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#interface Serial0/0/1
Router(config-if)#ip address 30.0.0.1 255.255.255.252
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#router rip
Router(config-router)#network 20.0.0.0
Router(config-router)#network 30.0.0.0
</pre>
</div>

<h3>2B. VTP (VLAN Trunking Protocol)</h3>
<p><strong>Aim:</strong> Implement VTP for VLAN management.</p>
<p><strong>Packet Tracer Setup:</strong> 4 Switches (2960). Switch1 is server (central), others connect to it. Use trunk links.</p>

<div id="practical2b">
<pre>
Switch0 (Client):
Switch>en
Switch#conf t
Switch(config)#int fa0/1
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit
Switch(config)#vtp mode client

Switch1 (Server - Default):
Switch#conf t
Switch(config)#int fa0/1
Switch(config-if)#switchport mode trunk
Switch(config-if)#int fa0/2
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit

Switch2 (Transparent):
Switch#conf t
Switch(config)#int fa0/1
Switch(config-if)#switchport mode trunk
Switch(config-if)#int fa0/2
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit
Switch(config)#vtp mode transparent

Switch3 (Client):
Switch#conf t
Switch(config)#int fa0/1
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit
Switch(config)#vtp mode client

Verify: show vtp status
</pre>
</div>

<h3>2C. NAT (Network Address Translation)</h3>
<p><strong>Aim:</strong> Implement NAT for private to public IP translation.</p>
<p><strong>Packet Tracer Setup:</strong> 2 Routers, 2 PCs, 1 Server. Connect PCs to R1 Fa0/0 via switch, R1 S0/0/0 to R2 S0/0/0, Server to R2 Fa0/0.</p>

<h4>Router R1 NAT Configuration</h4>
<div id="practical2c_r1">
<pre>
Router>enable
Router#configure terminal
Router(config)#interface FastEthernet0/0
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#interface Serial0/0/0
Router(config-if)#ip address 10.0.0.1 255.0.0.0
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown
Router(config-if)#exit

Router(config)#router rip
Router(config-router)#network 192.168.1.0
Router(config-router)#network 10.0.0.0
Router(config-router)#exit

Router(config)#int fa0/0
Router(config-if)#ip nat inside
Router(config-if)#exit
Router(config)#int s0/0/0
Router(config-if)#ip nat outside
Router(config-if)#exit

Router(config)#ip nat inside source static 192.168.1.2 10.0.0.1
Router(config)#ip nat inside source static 192.168.1.3 10.0.0.1
Router(config)#ip route 0.0.0.0 0.0.0.0 s0/0/0
Router(config)#exit

Router#show ip nat statistics
Router#show ip nat translations
</pre>
</div>

<h4>Router R2 Configuration</h4>
<div id="practical2c_r2">
<pre>
Router>enable
Router#configure terminal
Router(config)#interface Serial0/0/0
Router(config-if)#ip address 10.0.0.2 255.0.0.0
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#interface FastEthernet0/0
Router(config-if)#ip address 172.16.1.1 255.255.0.0
Router(config-if)#no shutdown
Router(config-if)#exit

Router(config)#router rip
Router(config-router)#network 172.16.0.0
Router(config-router)#network 10.0.0.0
Router(config-router)#exit
</pre>
</div>

<hr>

<h2>Practical 3: Inter-VLAN Routing</h2>
<p><strong>Aim:</strong> Implement Inter-VLAN Routing using Router-on-a-Stick.</p>
<p><strong>Packet Tracer Setup:</strong> 1 Router (R1), 2 Switches (S1, S2), 2 PCs. S1 Fa0/5 to R1 G0/0/1, S1 Fa0/1 to S2 Fa0/1 (trunk), PC-A to S1 Fa0/6, PC-B to S2 Fa0/18.</p>

<h4>Router R1 Configuration</h4>
<div id="practical3_router">
<pre>
Router>enable
Router#config terminal
Router(config)#hostname R1
R1(config)#no ip domain-lookup
R1(config)#enable secret class
R1(config)#line console 0
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#exit
R1(config)#line vty 0 4
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#exit
R1(config)#service password-encryption
R1(config)#banner motd $ Authorized Users Only! $

R1(config)#interface g0/0/1
R1(config-if)#no shutdown
R1(config-if)#exit

R1(config)#interface g0/0/1.10
R1(config-subif)#description Management Network
R1(config-subif)#encapsulation dot1q 10
R1(config-subif)#ip address 192.168.10.1 255.255.255.0
R1(config-subif)#exit

R1(config)#interface g0/0/1.20
R1(config-subif)#encapsulation dot1q 20
R1(config-subif)#description Sales Network
R1(config-subif)#ip address 192.168.20.1 255.255.255.0
R1(config-subif)#exit

R1(config)#interface g0/0/1.30
R1(config-subif)#encapsulation dot1q 30
R1(config-subif)#description Operations Network
R1(config-subif)#ip address 192.168.30.1 255.255.255.0
R1(config-subif)#exit

R1(config)#interface g0/0/1.1000
R1(config-subif)#encapsulation dot1q 1000 native
R1(config-subif)#description Native VLAN
R1(config-subif)#exit

R1#copy running-config startup-config
</pre>
</div>

<h4>Switch S1 Configuration</h4>
<div id="practical3_s1">
<pre>
Switch>enable
Switch#config terminal
Switch(config)#hostname S1
S1(config)#no ip domain-lookup
S1(config)#enable secret class
S1(config)#line console 0
S1(config-line)#password cisco
S1(config-line)#login
S1(config-line)#exit
S1(config)#line vty 0 4
S1(config-line)#password cisco
S1(config-line)#login
S1(config-line)#exit
S1(config)#service password-encryption
S1(config)#banner motd $ Authorized Users Only! $

S1(config)#vlan 10
S1(config-vlan)#name Management
S1(config-vlan)#vlan 20
S1(config-vlan)#name Sales
S1(config-vlan)#vlan 30
S1(config-vlan)#name Operations
S1(config-vlan)#vlan 999
S1(config-vlan)#name Parking_Lot
S1(config-vlan)#vlan 1000
S1(config-vlan)#name Native
S1(config-vlan)#exit

S1(config)#interface vlan 10
S1(config-if)#ip address 192.168.10.11 255.255.255.0
S1(config-if)#no shutdown
S1(config-if)#exit
S1(config)#ip default-gateway 192.168.10.1

S1(config)#interface range f0/2-4, f0/7-24, g0/1-2
S1(config-if-range)#switchport mode access
S1(config-if-range)#switchport access vlan 999
S1(config-if-range)#shutdown
S1(config-if-range)#exit

S1(config)#interface f0/6
S1(config-if)#switchport mode access
S1(config-if)#switchport access vlan 20
S1(config-if)#exit

S1(config)#interface f0/1
S1(config-if)#switchport mode trunk
S1(config-if)#switchport trunk native vlan 1000
S1(config-if)#switchport trunk allowed vlan 10,20,30,1000
S1(config-if)#exit

S1(config)#interface f0/5
S1(config-if)#switchport mode trunk
S1(config-if)#switchport trunk native vlan 1000
S1(config-if)#switchport trunk allowed vlan 10,20,30,1000
S1(config-if)#exit

S1#copy running-config startup-config
</pre>
</div>

<h4>Switch S2 Configuration</h4>
<div id="practical3_s2">
<pre>
Switch>enable
Switch#config terminal
Switch(config)#hostname S2
S2(config)#no ip domain-lookup
S2(config)#enable secret class
S2(config)#line console 0
S2(config-line)#password cisco
S2(config-line)#login
S2(config-line)#exit
S2(config)#line vty 0 4
S2(config-line)#password cisco
S2(config-line)#login
S2(config-line)#exit
S2(config)#service password-encryption
S2(config)#banner motd $ Authorized Users Only! $

S2(config)#vlan 10
S2(config-vlan)#name Management
S2(config-vlan)#vlan 20
S2(config-vlan)#name Sales
S2(config-vlan)#vlan 30
S2(config-vlan)#name Operations
S2(config-vlan)#vlan 999
S2(config-vlan)#name Parking_Lot
S2(config-vlan)#vlan 1000
S2(config-vlan)#name Native
S2(config-vlan)#exit

S2(config)#interface vlan 10
S2(config-if)#ip address 192.168.10.12 255.255.255.0
S2(config-if)#no shutdown
S2(config-if)#exit
S2(config)#ip default-gateway 192.168.10.1

S2(config)#interface range f0/2-17, f0/19-24, g0/1-2
S2(config-if-range)#switchport mode access
S2(config-if-range)#switchport access vlan 999
S2(config-if-range)#shutdown
S2(config-if-range)#exit

S2(config)#interface f0/18
S2(config-if)#switchport mode access
S2(config-if)#switchport access vlan 30
S2(config-if)#exit

S2(config)#interface f0/1
S2(config-if)#switchport mode trunk
S2(config-if)#switchport trunk native vlan 1000
S2(config-if)#switchport trunk allowed vlan 10,20,30,1000
S2(config-if)#exit

S2#copy running-config startup-config
</pre>
</div>

<hr>

<h2>Practical 4: Spanning Tree Protocol</h2>
<p><strong>Aim:</strong> Observe STP topology changes and implement RSTP.</p>
<p><strong>Packet Tracer Setup:</strong> 3 Multilayer Switches (D1, D2, A1) in triangle topology. Use Gigabit for D1-D2, FastEthernet for A1.</p>

<h4>Switch D1 Configuration</h4>
<div id="practical4_d1">
<pre>
Switch>enable
Switch#config terminal
Switch(config)#hostname D1
D1(config)#spanning-tree mode pvst
D1(config)#line con 0
D1(config-line)#exec-timeout 0 0
D1(config-line)#logging synchronous
D1(config-line)#exit

D1(config)#interface range g1/0/1-24
D1(config-if-range)#shutdown
D1(config-if-range)#exit

D1(config)#interface range g1/0/1, g1/0/5-6
D1(config-if-range)#switchport mode trunk
D1(config-if-range)#no shutdown
D1(config-if-range)#exit

D1(config)#vlan 2
D1(config-vlan)#name SecondVLAN
D1(config-vlan)#exit

D1(config)#interface vlan 1
D1(config-if)#ip address 10.0.0.1 255.0.0.0
D1(config-if)#no shut
D1(config-if)#exit
</pre>
</div>

<h4>Switch D2 Configuration</h4>
<div id="practical4_d2">
<pre>
Switch>enable
Switch#config terminal
Switch(config)#hostname D2
D2(config)#spanning-tree mode pvst
D2(config)#line con 0
D2(config-line)#exec-timeout 0 0
D2(config-line)#logging synchronous
D2(config-line)#exit

D2(config)#interface range g1/0/1-24
D2(config-if-range)#shutdown
D2(config-if-range)#exit

D2(config)#interface range g1/0/1, g1/0/5-6
D2(config-if-range)#switchport mode trunk
D2(config-if-range)#no shutdown
D2(config-if-range)#exit

D2(config)#vlan 2
D2(config-vlan)#name SecondVLAN
D2(config-vlan)#exit

D2(config)#interface vlan 1
D2(config-if)#ip address 10.0.0.2 255.0.0.0
D2(config-if)#no shut
D2(config-if)#exit
</pre>
</div>

<h4>Switch A1 Configuration</h4>
<div id="practical4_a1">
<pre>
Switch>enable
Switch#config terminal
Switch(config)#hostname A1
A1(config)#spanning-tree mode pvst
A1(config)#line con 0
A1(config-line)#exec-timeout 0 0
A1(config-line)#logging synchronous
A1(config-line)#exit

A1(config)#interface range f0/1-24, g0/1-2
A1(config-if-range)#shutdown
A1(config-if-range)#exit

A1(config)#interface range f0/1-4
A1(config-if-range)#switchport mode trunk
A1(config-if-range)#no shutdown
A1(config-if-range)#exit

A1(config)#vlan 2
A1(config-vlan)#name SecondVLAN
A1(config-vlan)#exit

A1(config)#interface vlan 1
A1(config-if)#ip address 10.0.0.3 255.0.0.0
A1(config-if)#no shut
A1(config-if)#exit
</pre>
</div>

<h4>Configure RSTP</h4>
<div id="practical4_rstp">
<pre>
D1#debug spanning-tree events
D1#config t
D1(config)#interface g1/0/1
D1(config-if)#shutdown

D2(config)#spanning-tree mode rapid-pvst

D1(config-if)#no shutdown

A1(config)#spanning-tree mode rapid-pvst

Verify: show spanning-tree
</pre>
</div>

<h4>MST Configuration</h4>
<div id="practical4_mst">
<pre>
D1(config)#spanning-tree mode mst
D1(config)#spanning-tree mst configuration
D1(config-mst)#name REGION1
D1(config-mst)#revision 1
D1(config-mst)#instance 1 vlan 1-10
D1(config-mst)#instance 2 vlan 11-20
D1(config-mst)#exit
D1(config)#spanning-tree mst 1 priority 4096
</pre>
</div>

<hr>

<h2>Practical 5: EtherChannel Implementation</h2>
<p><strong>Aim:</strong> Implement EtherChannel using PAgP and LACP.</p>
<p><strong>Packet Tracer Setup:</strong> 3 Switches (2960) - SWA, SWB, SWC. Connect with multiple links per Port Channel specification.</p>

<h4>Switch SWA Configuration</h4>
<div id="practical5_swa">
<pre>
Switch>enable
Switch#config terminal
Switch(config)#hostname SWA

SWA(config)#interface FastEthernet0/21
SWA(config-if)#switchport mode trunk
SWA(config-if)#channel-group 2 mode active
SWA(config-if)#exit

SWA(config)#interface FastEthernet0/22
SWA(config-if)#switchport mode trunk
SWA(config-if)#channel-group 2 mode active
SWA(config-if)#exit

SWA(config)#interface GigabitEthernet0/1
SWA(config-if)#switchport mode trunk
SWA(config-if)#channel-group 1 mode desirable
SWA(config-if)#exit

SWA(config)#interface GigabitEthernet0/2
SWA(config-if)#switchport mode trunk
SWA(config-if)#channel-group 1 mode desirable
SWA(config-if)#exit

SWA#show etherchannel summary

SWA#show etherchannel summary
</pre>
</div>

<h4>Switch SWB Configuration</h4>
<div id="practical5_swb">
<pre>
Switch>enable
Switch#config terminal
Switch(config)#hostname SWB

SWB(config)#interface FastEthernet0/23
SWB(config-if)#switchport mode trunk
SWB(config-if)#channel-group 3 mode passive
SWB(config-if)#exit

SWB(config)#interface FastEthernet0/24
SWB(config-if)#switchport mode trunk
SWB(config-if)#channel-group 3 mode passive
SWB(config-if)#exit

SWB(config)#interface GigabitEthernet0/1
SWB(config-if)#switchport mode trunk
SWB(config-if)#channel-group 1 mode desirable
SWB(config-if)#exit

SWB(config)#interface GigabitEthernet0/2
SWB(config-if)#switchport mode trunk
SWB(config-if)#channel-group 1 mode desirable
SWB(config-if)#exit

SWB#show etherchannel summary
</pre>
</div>

<h4>Switch SWC Configuration</h4>
<div id="practical5_swc">
<pre>
Switch>enable
Switch#config terminal
Switch(config)#hostname SWC

SWC(config)#interface FastEthernet0/21
SWC(config-if)#switchport mode trunk
SWC(config-if)#channel-group 2 mode active
SWC(config-if)#exit

SWC(config)#interface FastEthernet0/22
SWC(config-if)#switchport mode trunk
SWC(config-if)#channel-group 2 mode active
SWC(config-if)#exit

SWC(config)#interface FastEthernet0/23
SWC(config-if)#switchport mode trunk
SWC(config-if)#channel-group 3 mode active
SWC(config-if)#exit

SWC(config)#interface FastEthernet0/24
SWC(config-if)#switchport mode trunk
SWC(config-if)#channel-group 3 mode active
SWC(config-if)#exit

SWC#show etherchannel summary
</pre>
</div>

<hr>

<h2>Practical 6: OSPF Implementation</h2>

<h3>6A. Single-Area OSPFv2</h3>
<p><strong>Aim:</strong> Implement Single-Area OSPFv2.</p>
<p><strong>Packet Tracer Setup:</strong> 3 Routers, 3 PCs. Triangle topology with serial connections between routers.</p>

<h4>Router R1 Configuration</h4>
<div id="practical6a_r1">
<pre>
Router>enable
Router#configure terminal
Router(config)#hostname R1

R1(config)#interface GigabitEthernet0/0
R1(config-if)#ip address 192.168.1.1 255.255.255.0
R1(config-if)#no shutdown
R1(config-if)#exit

R1(config)#interface Serial0/0/0
R1(config-if)#ip address 192.168.12.1 255.255.255.252
R1(config-if)#clock rate 64000
R1(config-if)#no shutdown
R1(config-if)#exit

R1(config)#interface Serial0/0/1
R1(config-if)#ip address 192.168.13.1 255.255.255.252
R1(config-if)#no shutdown
R1(config-if)#exit

R1(config)#router ospf 1
R1(config-router)#network 192.168.1.0 0.0.0.255 area 0
R1(config-router)#network 192.168.12.0 0.0.0.3 area 0
R1(config-router)#network 192.168.13.0 0.0.0.3 area 0
R1(config-router)#exit
</pre>
</div>

<h4>Router R2 Configuration</h4>
<div id="practical6a_r2">
<pre>
Router>enable
Router#configure terminal
Router(config)#hostname R2

R2(config)#interface GigabitEthernet0/0
R2(config-if)#ip address 192.168.2.1 255.255.255.0
R2(config-if)#no shutdown
R2(config-if)#exit

R2(config)#interface Serial0/0/0
R2(config-if)#ip address 192.168.12.2 255.255.255.252
R2(config-if)#no shutdown
R2(config-if)#exit

R2(config)#interface Serial0/0/1
R2(config-if)#ip address 192.168.23.1 255.255.255.252
R2(config-if)#clock rate 64000
R2(config-if)#no shutdown
R2(config-if)#exit

R2(config)#router ospf 1
R2(config-router)#network 192.168.2.0 0.0.0.255 area 0
R2(config-router)#network 192.168.12.0 0.0.0.3 area 0
R2(config-router)#network 192.168.23.0 0.0.0.3 area 0
R2(config-router)#exit
</pre>
</div>

<h4>Router R3 Configuration</h4>
<div id="practical6a_r3">
<pre>
Router>enable
Router#configure terminal
Router(config)#hostname R3

R3(config)#interface GigabitEthernet0/0
R3(config-if)#ip address 192.168.3.1 255.255.255.0
R3(config-if)#no shutdown
R3(config-if)#exit

R3(config)#interface Serial0/0/0
R3(config-if)#ip address 192.168.13.2 255.255.255.252
R3(config-if)#clock rate 64000
R3(config-if)#no shutdown
R3(config-if)#exit

R3(config)#interface Serial0/0/1
R3(config-if)#ip address 192.168.23.2 255.255.255.252
R3(config-if)#no shutdown
R3(config-if)#exit

R3(config)#router ospf 1
R3(config-router)#network 192.168.3.0 0.0.0.255 area 0
R3(config-router)#network 192.168.13.0 0.0.0.3 area 0
R3(config-router)#network 192.168.23.0 0.0.0.3 area 0
R3(config-router)#exit

Verification Commands:
show ip ospf neighbor
show ip route
show ip protocols
show ip ospf interface brief
</pre>
</div>

<h3>6B. Multi-Area OSPFv2</h3>
<div id="practical6b">
<pre>
R1 (Area 0):
R1(config)#router ospf 1
R1(config-router)#network 192.168.1.0 0.0.0.255 area 0
R1(config-router)#network 192.168.15.0 0.0.0.3 area 0
R1(config-router)#network 192.168.12.0 0.0.0.3 area 0
R1(config-router)#exit

R2 (Area 0 and Area 1):
R2(config)#router ospf 1
R2(config-router)#network 192.168.2.0 0.0.0.255 area 1
R2(config-router)#network 192.168.12.0 0.0.0.3 area 0
R2(config-router)#network 192.168.13.0 0.0.0.3 area 1
R2(config-router)#exit

R3 (Area 1 and Area 2):
R3(config)#router ospf 1
R3(config-router)#network 192.168.3.0 0.0.0.255 area 2
R3(config-router)#network 192.168.13.0 0.0.0.3 area 1
R3(config-router)#network 192.168.14.0 0.0.0.3 area 2
R3(config-router)#exit

R4 (Area 0 and Area 2):
R4(config)#router ospf 1
R4(config-router)#network 192.168.4.0 0.0.0.255 area 0
R4(config-router)#network 192.168.15.0 0.0.0.3 area 0
R4(config-router)#network 192.168.14.0 0.0.0.3 area 2
R4(config-router)#exit
</pre>
</div>

<h3>6C. OSPF Route Summarization</h3>
<div id="practical6c">
<pre>
R2(config)#router ospf 1
R2(config-router)#area 1 range 192.168.0.0 255.255.252.0
R2(config-router)#exit
</pre>
</div>

<h3>6D. OSPFv3 Configuration</h3>
<div id="practical6d">
<pre>
R1(config)#ipv6 unicast-routing
R1(config)#interface g0/0
R1(config-if)#ipv6 address 2001:db8:1::1/64
R1(config-if)#ipv6 ospf 1 area 0
R1(config-if)#no shutdown
R1(config-if)#exit
R1(config)#ipv6 router ospf 1
R1(config-rtr)#router-id 1.1.1.1
R1(config-rtr)#exit
</pre>
</div>

<hr>

<h2>Practical 7: BGP Implementation</h2>
<p><strong>Aim:</strong> Configure BGP for inter-autonomous system routing.</p>
<p><strong>Packet Tracer Setup:</strong> 3 Routers (different AS), 3 PCs. Serial connections between routers.</p>

<h4>Router R1 Configuration (AS 100)</h4>
<div id="practical7_r1">
<pre>
Router>enable
Router#configure terminal
Router(config)#hostname R1

R1(config)#interface FastEthernet0/0
R1(config-if)#ip address 10.0.0.1 255.0.0.0
R1(config-if)#no shutdown
R1(config-if)#exit

R1(config)#interface Serial0/0/0
R1(config-if)#ip address 40.0.0.1 255.0.0.0
R1(config-if)#clock rate 64000
R1(config-if)#no shutdown
R1(config-if)#exit

R1(config)#interface Serial0/0/1
R1(config-if)#ip address 60.0.0.1 255.0.0.0
R1(config-if)#clock rate 64000
R1(config-if)#no shutdown
R1(config-if)#exit

R1(config)#router bgp 100
R1(config-router)#neighbor 40.0.0.2 remote-as 200
R1(config-router)#neighbor 60.0.0.2 remote-as 300
R1(config-router)#network 10.0.0.0 mask 255.0.0.0
R1(config-router)#exit
</pre>
</div>

<h4>Router R2 Configuration (AS 200)</h4>
<div id="practical7_r2">
<pre>
Router>enable
Router#configure terminal
Router(config)#hostname R2

R2(config)#interface FastEthernet0/0
R2(config-if)#ip address 20.0.0.1 255.0.0.0
R2(config-if)#no shutdown
R2(config-if)#exit

R2(config)#interface Serial0/0/0
R2(config-if)#ip address 40.0.0.2 255.0.0.0
R2(config-if)#no shutdown
R2(config-if)#exit

R2(config)#interface Serial0/0/1
R2(config-if)#ip address 50.0.0.1 255.0.0.0
R2(config-if)#clock rate 64000
R2(config-if)#no shutdown
R2(config-if)#exit

R2(config)#router bgp 200
R2(config-router)#neighbor 40.0.0.1 remote-as 100
R2(config-router)#neighbor 50.0.0.2 remote-as 300
R2(config-router)#network 20.0.0.0 mask 255.0.0.0
R2(config-router)#exit
</pre>
</div>

<h4>Router R3 Configuration (AS 300)</h4>
<div id="practical7_r3">
<pre>
Router>enable
Router#configure terminal
Router(config)#hostname R3

R3(config)#interface FastEthernet0/0
R3(config-if)#ip address 30.0.0.1 255.0.0.0
R3(config-if)#no shutdown
R3(config-if)#exit

R3(config)#interface Serial0/0/0
R3(config-if)#ip address 60.0.0.2 255.0.0.0
R3(config-if)#no shutdown
R3(config-if)#exit

R3(config)#interface Serial0/0/1
R3(config-if)#ip address 50.0.0.2 255.0.0.0
R3(config-if)#no shutdown
R3(config-if)#exit

R3(config)#router bgp 300
R3(config-router)#neighbor 60.0.0.1 remote-as 100
R3(config-router)#neighbor 50.0.0.1 remote-as 200
R3(config-router)#network 30.0.0.0 mask 255.0.0.0
R3(config-router)#exit

Verification Commands:
show ip bgp
show ip bgp summary
show ip bgp neighbors
show ip route bgp
</pre>
</div>

<hr>

<h2>Practical 8: VPN Implementation</h2>

<h3>8A. IPsec Site-to-Site VPN</h3>
<p><strong>Aim:</strong> Configure IPsec VPN for secure site-to-site communication.</p>
<p><strong>Packet Tracer Setup:</strong> 3 Routers, 3 PCs. R1-R2-R3 connected via serial. VPN tunnel between R1 and R3.</p>

<h4>Router R1 Configuration</h4>
<div id="practical8_r1">
<pre>
Router>enable
Router#configure terminal
Router(config)#hostname R1

R1(config)#interface GigabitEthernet0/0
R1(config-if)#ip address 192.168.1.1 255.255.255.0
R1(config-if)#no shutdown
R1(config-if)#exit

R1(config)#interface Serial0/0/0
R1(config-if)#ip address 10.1.1.2 255.255.255.252
R1(config-if)#clock rate 64000
R1(config-if)#no shutdown
R1(config-if)#exit

R1(config)#router rip
R1(config-router)#network 10.0.0.0
R1(config-router)#network 192.168.1.0
R1(config-router)#exit

R1(config)#license boot module c1900 technology-package securityk9

R1(config)#access-list 110 permit ip 192.168.1.0 0.0.0.255 192.168.3.0 0.0.0.255

R1(config)#crypto isakmp policy 10
R1(config-isakmp)#encryption aes 256
R1(config-isakmp)#authentication pre-share
R1(config-isakmp)#group 5
R1(config-isakmp)#exit

R1(config)#crypto isakmp key vpnpa55 address 10.2.2.2

R1(config)#crypto ipsec transform-set VPN-SET esp-aes esp-sha-hmac

R1(config)#crypto map VPN-MAP 10 ipsec-isakmp
R1(config-crypto-map)#description VPN connection to R3
R1(config-crypto-map)#set peer 10.2.2.2
R1(config-crypto-map)#set transform-set VPN-SET
R1(config-crypto-map)#match address 110
R1(config-crypto-map)#exit

R1(config)#interface s0/0/0
R1(config-if)#crypto map VPN-MAP
R1(config-if)#exit
</pre>
</div>

<h4>Router R2 Configuration</h4>
<div id="practical8_r2">
<pre>
Router>enable
Router#configure terminal
Router(config)#hostname R2

R2(config)#interface GigabitEthernet0/0
R2(config-if)#ip address 192.168.2.1 255.255.255.0
R2(config-if)#no shutdown
R2(config-if)#exit

R2(config)#interface Serial0/0/0
R2(config-if)#ip address 10.1.1.1 255.255.255.252
R2(config-if)#no shutdown
R2(config-if)#exit

R2(config)#interface Serial0/0/1
R2(config-if)#ip address 10.2.2.1 255.255.255.252
R2(config-if)#clock rate 64000
R2(config-if)#no shutdown
R2(config-if)#exit

R2(config)#router rip
R2(config-router)#network 10.0.0.0
R2(config-router)#network 192.168.2.0
R2(config-router)#exit
</pre>
</div>

<h4>Router R3 Configuration</h4>
<div id="practical8_r3">
<pre>
Router>enable
Router#configure terminal
Router(config)#hostname R3

R3(config)#interface GigabitEthernet0/0
R3(config-if)#ip address 192.168.3.1 255.255.255.0
R3(config-if)#no shutdown
R3(config-if)#exit

R3(config)#interface Serial0/0/1
R3(config-if)#ip address 10.2.2.2 255.255.255.252
R3(config-if)#no shutdown
R3(config-if)#exit

R3(config)#router rip
R3(config-router)#network 10.0.0.0
R3(config-router)#network 192.168.3.0
R3(config-router)#exit

R3(config)#license boot module c1900 technology-package securityk9

R3(config)#access-list 110 permit ip 192.168.3.0 0.0.0.255 192.168.1.0 0.0.0.255

R3(config)#crypto isakmp policy 10
R3(config-isakmp)#encryption aes 256
R3(config-isakmp)#authentication pre-share
R3(config-isakmp)#group 5
R3(config-isakmp)#exit

R3(config)#crypto isakmp key vpnpa55 address 10.1.1.2

R3(config)#crypto ipsec transform-set VPN-SET esp-aes esp-sha-hmac

R3(config)#crypto map VPN-MAP 10 ipsec-isakmp
R3(config-crypto-map)#description VPN connection to R1
R3(config-crypto-map)#set peer 10.1.1.2
R3(config-crypto-map)#set transform-set VPN-SET
R3(config-crypto-map)#match address 110
R3(config-crypto-map)#exit

R3(config)#interface s0/0/1
R3(config-if)#crypto map VPN-MAP
R3(config-if)#exit

Verification Commands:
show crypto isakmp policy
show crypto isakmp sa
show crypto ipsec transform-set
show crypto map
show crypto ipsec sa
</pre>
</div>

<h3>8B. GRE over IPsec</h3>
<div id="practical8_gre">
<pre>
R1(config)#interface tunnel 0
R1(config-if)#ip address 172.16.0.1 255.255.255.252
R1(config-if)#tunnel source serial0/0/0
R1(config-if)#tunnel destination 10.2.2.2
R1(config-if)#tunnel mode gre ip
R1(config-if)#exit

R1(config)#crypto ipsec profile IPSEC-PROFILE
R1(ipsec-profile)#set transform-set VPN-SET
R1(ipsec-profile)#exit

R1(config)#interface tunnel 0
R1(config-if)#tunnel protection ipsec profile IPSEC-PROFILE
R1(config-if)#exit

R3(config)#interface tunnel 0
R3(config-if)#ip address 172.16.0.2 255.255.255.252
R3(config-if)#tunnel source serial0/0/1
R3(config-if)#tunnel destination 10.1.1.2
R3(config-if)#tunnel mode gre ip
R3(config-if)#exit

R3(config)#crypto ipsec profile IPSEC-PROFILE
R3(ipsec-profile)#set transform-set VPN-SET
R3(ipsec-profile)#exit

R3(config)#interface tunnel 0
R3(config-if)#tunnel protection ipsec profile IPSEC-PROFILE
R3(config-if)#exit
</pre>
</div>

<h3>8C. VRF Lite</h3>
<div id="practical8_vrf">
<pre>
R1(config)#ip vrf CUSTOMER-A
R1(config-vrf)#rd 100:1
R1(config-vrf)#exit

R1(config)#ip vrf CUSTOMER-B
R1(config-vrf)#rd 100:2
R1(config-vrf)#exit

R1(config)#interface GigabitEthernet0/0
R1(config-if)#ip vrf forwarding CUSTOMER-A
R1(config-if)#ip address 192.168.1.1 255.255.255.0
R1(config-if)#no shutdown
R1(config-if)#exit

R1(config)#interface GigabitEthernet0/1
R1(config-if)#ip vrf forwarding CUSTOMER-B
R1(config-if)#ip address 192.168.2.1 255.255.255.0
R1(config-if)#no shutdown
R1(config-if)#exit

Verification Commands:
show ip vrf
show ip route vrf CUSTOMER-A
show ip route vrf CUSTOMER-B
</pre>
</div>

<hr>

<h2>Practical 9: SDN Simulation with Controllers</h2>

<h3>9A. OpenDaylight with Mininet</h3>
<p><strong>Aim:</strong> Simulate SDN using OpenDaylight controller with Mininet.</p>
<p><strong>Note:</strong> Requires Linux system with Mininet and OpenDaylight installed.</p>

<div id="practical9_mininet">
<pre>
Mininet Installation (Linux):
sudo apt-get update
sudo apt-get install mininet
sudo mn --version

OpenDaylight Installation:
wget https://nexus.opendaylight.org/content/repositories/opendaylight.release/org/opendaylight/integration/karaf/0.8.4/karaf-0.8.4.tar.gz
tar -xvf karaf-0.8.4.tar.gz
cd karaf-0.8.4
./bin/karaf

Install ODL Features:
opendaylight-user@root>feature:install odl-restconf
opendaylight-user@root>feature:install odl-l2switch-switch-ui
opendaylight-user@root>feature:install odl-mdsal-apidocs
opendaylight-user@root>feature:install odl-dluxapps-applications

Create Mininet Topology:
sudo mn --controller=remote,ip=127.0.0.1,port=6633 --topo tree,2

Mininet Commands:
mininet> nodes
mininet> net
mininet> links
mininet> h1 ping h2
mininet> pingall
mininet> dump
mininet> exit

Access OpenDaylight DLUX UI:
Open browser: http://localhost:8181/index.html
Username: admin
Password: admin
</pre>
</div>

<h3>9B. OFNet SDN Emulator</h3>
<div id="practical9_ofnet">
<pre>
OFNet Installation:
git clone https://github.com/onfsdn/OFNet.git
cd OFNet
sudo python setup.py install

Create OFNet Topology:
from ofnet.topology import Topology
from ofnet.node import Controller, Switch, Host

topo = Topology()
c1 = topo.addController('c1')
s1 = topo.addSwitch('s1')
s2 = topo.addSwitch('s2')
h1 = topo.addHost('h1')
h2 = topo.addHost('h2')

topo.addLink(h1, s1)
topo.addLink(h2, s2)
topo.addLink(s1, s2)

topo.start()
</pre>
</div>

<hr>

<h2>Practical 10: OpenFlow Using Mininet</h2>
<p><strong>Aim:</strong> Simulate OpenFlow protocol using Mininet for SDN experimentation.</p>
<p><strong>Prerequisites:</strong> Linux system, Mininet, OpenFlow controller (POX/Ryu/Floodlight).</p>

<div id="practical10">
<pre>
Install POX Controller:
git clone https://github.com/noxrepo/pox
cd pox
./pox.py forwarding.l2_learning

Basic Mininet Topology:
sudo mn --topo single,3 --mac --controller remote --switch ovsk

mininet> nodes
mininet> net
mininet> dump

Custom Topology Script:
from mininet.topo import Topo
from mininet.net import Mininet
from mininet.node import RemoteController
from mininet.cli import CLI
from mininet.log import setLogLevel

class CustomTopo(Topo):
    def build(self):
        s1 = self.addSwitch('s1')
        s2 = self.addSwitch('s2')
        s3 = self.addSwitch('s3')
        
        h1 = self.addHost('h1', ip='10.0.0.1/24')
        h2 = self.addHost('h2', ip='10.0.0.2/24')
        h3 = self.addHost('h3', ip='10.0.0.3/24')
        h4 = self.addHost('h4', ip='10.0.0.4/24')
        
        self.addLink(h1, s1)
        self.addLink(h2, s1)
        self.addLink(h3, s2)
        self.addLink(h4, s3)
        self.addLink(s1, s2)
        self.addLink(s2, s3)
        self.addLink(s3, s1)

def runCustomTopo():
    topo = CustomTopo()
    net = Mininet(topo=topo, controller=RemoteController)
    net.start()
    CLI(net)
    net.stop()

if __name__ == '__main__':
    setLogLevel('info')
    runCustomTopo()

Run Custom Topology:
sudo python custom_topo.py

OpenFlow Switch Configuration:
sudo ovs-vsctl show
sudo ovs-vsctl list-br
sudo ovs-vsctl list-ports s1
sudo ovs-ofctl show s1
sudo ovs-ofctl dump-flows s1
sudo ovs-ofctl dump-tables s1

Add Flow Entries Manually:
sudo ovs-ofctl add-flow s1 priority=100,in_port=1,actions=output:2
sudo ovs-ofctl add-flow s1 priority=100,in_port=2,actions=output:1
sudo ovs-ofctl dump-flows s1

Test Connectivity:
mininet> h1 ping h2
mininet> h1 ping h3
mininet> pingall
mininet> iperf h1 h2

Monitor Traffic:
mininet> h1 ifconfig
mininet> s1 ifconfig
mininet> dump

Advanced OpenFlow Commands:
sudo ovs-ofctl add-flow s1 "table=0,priority=100,dl_type=0x0800,nw_dst=10.0.0.2,actions=output:2"
sudo ovs-ofctl add-flow s1 "table=0,priority=100,dl_type=0x0806,actions=flood"
sudo ovs-ofctl mod-flows s1 "table=0,priority=100,dl_type=0x0800,nw_dst=10.0.0.2,actions=output:3"
sudo ovs-ofctl del-flows s1

Create Linear Topology:
sudo mn --topo linear,4 --mac --controller remote --switch ovsk

Create Tree Topology:
sudo mn --topo tree,depth=2,fanout=3 --mac --controller remote --switch ovsk

Performance Testing:
mininet> iperf h1 h2
mininet> h1 ping -c 10 h2
mininet> h1 traceroute h3

Clean Up Mininet:
sudo mn -c
sudo ovs-vsctl show
</pre>
</div>

<hr>

<h2>General Verification Commands</h2>

<h4>Router Commands</h4>
<pre>
show running-config
show ip interface brief
show ip route
show interfaces
show version
show protocols
ping [ip-address]
traceroute [ip-address]
show cdp neighbors
show clock
</pre>

<h4>Switch Commands</h4>
<pre>
show running-config
show vlan brief
show interfaces status
show interfaces trunk
show spanning-tree
show mac address-table
show port-channel summary
show etherchannel summary
show vtp status
</pre>

<h4>Debugging Commands</h4>
<pre>
debug ip packet
debug ip routing
debug spanning-tree events
debug etherchannel
no debug all
undebug all
</pre>

<hr>

<footer>
<p><strong>End of SDN Practicals Document</strong></p>
<p>SIES (Nerul) College of Arts, Science and Commerce (Autonomous)</p>
<p>Master of Science in Computer Science - Academic Year 2025-2026</p>
<p>Submitted by: Darshan Jadhav | Roll No: MCS.25.06</p>
<p>Guide: Ms. Flosia Moses</p>
</footer>

</body>
</html>